const { PrismaClient } = require("../../../prisma/generated/prisma");
const { toCamelCase } = require("../../../middleware/utils");
const prisma = new PrismaClient();

const mockData = [
  {
    id: "1",
    title:
      'รมช.อนุชา ชู "อั๋นฟาร์ม" ต้นแบบความสำเร็จ "โคต้นน้ำ" ปลูกหญ้าเลี้ยงสัตว์',
    detail:
      "รมช.อนุชา ชื่นชมความสำเร็จของ “อั๋นฟาร์ม” ชูเป็นต้นแบบเปลี่ยนจากปลูกพืชเชิงเดี่ยว มาปลูกหญ้าเลี้ยงสัตว์เป็นโคต้นน้ำ โดยเริ่มต้นที่ดิน 15 ไร่ ผ่านไป 10 ปี มีที่ดินเพิ่ม 93 ไร่ วัวกว่า 50 ตัว หลุดพ้นความยากจนจากการเลี้ยงวัว\nนายอนุชา นาคาศัย รัฐมนตรีช่วยว่าการกระทรวงเกษตรและสหกรณ์ เปิดเผยภายหลังนำคณะผู้บริหารส่วนท้องถิ่น ผู้นำชุมชน และตัวแทนเกษตรกรจังหวัดชัยนาทจำนวนกว่า 200 คน ลงพื้นที่ศึกษาดูงานแปลงต้นแบบในการปรับเปลี่ยนการผลิตในพื้นที่ไม่เหมาะสม ด้วยการทำปศุสัตว์ “อั๋นฟาร์ม” ของนายวีระชาติ อ่อนนอ บ้านสะอาดนามูล เกษตรกรต้นแบบของการปรับเปลี่ยนพื้นที่จากการทำเกษตรกรรมเชิงเดี่ยวมาปลูกหญ้าเลี้ยงสัตว์ และยังเป็นต้นแบบของการเลี้ยงโคต้นน้ำ ณ ต.ห้วยสามพาด อ.ประจักษ์ศิลปาคม จ.อุดรธานี",
    image:
      "https://static.thairath.co.th/media/dFQROr7oWzulq5Fa5LTfiKwWfc5k7JXYEAmrdHBRR9Zwuen3v8BSMwmkPGGqAEs5FTd.jpg",
    date: "วันที่ 20/10/2564",
  },
  {
    id: "2",
    title:
      "ผู้เลี้ยงวัวนมโคราชเฮ ราคาประกันซื้อนมดิบขึ้น 2 บาท ทำชีวิตความเป็นอยู่ดีขึ้น",
    detail:
      "เกษตรกรผู้เลี้ยงวัวนมใน ต.นิคม อ.พิมาย จ.นครราชสีมาได้เฮ หลังราคาประกันรับซื้อน้ำนมดิบ ปรับขึ้น 2 บาท ทำเกษตรกรมีรายได้ดี มีกำไรเฉลี่ยเดือนละแสนบาท ทำให้ชีวิตความเป็นอยู่ดีขึ้น \nเมื่อวันที่ 5 มี.ค. 2567 นายอานัติ แสงพิมาย อายุ 49 ปี ผู้ใหญ่บ้าน หมู่ 18 ตำบลนิคมสร้างตนเอง อำเภอพิมาย จังหวัดนครราชสีมา หนึ่งในเกษตรกรผู้เลี้ยงวัวนมในตำบลนิคม เปิดเผยว่า เมื่อก่อนครอบครัวปลูกพืชไร่เป็นอาชีพหลัก แต่เจอปัญหาภัยธรรมชาติ ทำให้ได้ผลผลิตไม่เต็มเม็ดเต็มหน่วย จึงตัดสินใจหันมาเลี้ยงวัวนม โดยเข้าอบรมอาชีพการเลี้ยงวัวนมกับสหกรณ์โคนมพิมาย จำกัด หลังจากนั้น ได้ลงทุนซื้อวัวนม มาเลี้ยงในราคาตัวละ 30,000-35,000 บาท จำนวน 20 ตัว ต่อมา มีการผสมพันธุ์เทียมและขยายพันธุ์วัวนมเพิ่มขึ้นเรื่อยๆ ทุกปี จนกระทั่งมีจำนวนแม่นมมากกว่า 80 ตัว สร้างรายได้จากการจำหน่ายน้ำนมดิบทุกวัน เฉลี่ยไม่ต่ำกว่าวันละ 7,000-8,000 บาท",
    image:
      "https://static.thairath.co.th/media/dFQROr7oWzulq5Fa5LTaf7YnTdCKV7PdnJO1LN1tjiNrAOdNQOXOkqHZQxQCuZcMK0O.jpg",
    date: "วันที่ 20/10/2564",
  },
  {
    id: "3",
    title: "“สมศักดิ์” ดันต่อโคเงินล้าน ส่งเสริมสร้างงาน สร้างอาชีพ",
    detail:
      "นายสมศักดิ์ เทพสุทิน รองนายกรัฐมนตรี เปิดเผยภายหลังเป็นประธานการประชุมคณะกรรมการกองทุนหมู่บ้านและชุมชนเมืองแห่งชาติ ว่า กองทุนหมู่บ้านฯจะลงนามบันทึกข้อตกลงความร่วมมือ (MOU) กับกรมปศุสัตว์ เพื่อส่งเสริมการสร้างงาน สร้างอาชีพให้กับสมาชิกกองทุนหมู่บ้านฯ ในการเลี้ยงปศุสัตว์ เพื่อให้สอดคล้องกับที่นายเศรษฐา ทวีสิน นายกรัฐมนตรีและ รมว.คลัง ได้เจรจาการส่งออกโคให้กับซาอุดีอาระเบีย และจีน ซึ่งจะทำให้สมาชิกที่เลี้ยงโคสามารถส่งออกไปต่างประเทศได้ ดังนั้น กองทุนหมู่บ้านฯต้องตื่นตัว และเร่งส่งเสริมสร้างความพร้อมให้กับสมาชิก",
    image:
      "https://static.thairath.co.th/media/dFQROr7oWzulq5Fa5LJGNlKRsAql8ZlCOgTFPUcC8BjJsao0TbqUaPUthDoTRqnR8T6.jpg",
    date: "วันที่ 20/10/2564",
  },
];

exports.getAll = async (req, res, next) => {
  try {
    const data = mockData;
    // const data = await prisma.user.findMany();
    res.status(200).json({ status: "success", data: toCamelCase(data) });
  } catch (error) {
    res.status(400).json({ status: "error", error: error.message });
  }
};
exports.getId = async (req, res, next) => {
  try {
    const { id } = req.params;
    const data = mockData.find((item) => item.id === id);
    // const data = await prisma.user.findFirst({
    //   where: { id: id },
    // });
    if (!data) {
      res.status(404).json({ status: "error", message: "Data not found" });
    }
    res.status(200).json({ status: "success", data: toCamelCase(data) });
  } catch (error) {
    res.status(400).json({ status: "error", error: error.message });
  }
};
